InformationRegisters/КоэффициентИндексацииЗаработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КоэффициентИндексацииЗаработка</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентИндексации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИндексации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КоэффициентИндексацииЗаработка/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// ЗУП РК индексация в рамках дня
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборДанных", ЭтотОбъект.Выгрузить(,"Период, Сотрудник, ДатаИндексации"));
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НаборДанных.Период КАК Период,
	               |	НаборДанных.Сотрудник КАК Сотрудник,
	               |	НаборДанных.ДатаИндексации КАК ДатаИндексации
	               |ПОМЕСТИТЬ ВТДанныеНабора
	               |ИЗ
	               |	&НаборДанных КАК НаборДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеНабора.Период КАК Период,
	               |	ДанныеНабора.Сотрудник КАК Сотрудник,
	               |	ДанныеНабора.ДатаИндексации КАК ДатаИндексации
	               |ИЗ
	               |	РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеНабора КАК ДанныеНабора
	               |		ПО НЕ КоэффициентИндексацииЗаработка.Регистратор = &Регистратор 
	               |			И КоэффициентИндексацииЗаработка.Сотрудник = ДанныеНабора.Сотрудник
	               |			И КоэффициентИндексацииЗаработка.ДатаИндексации = ДанныеНабора.ДатаИндексации
	               |			И НАЧАЛОПЕРИОДА(КоэффициентИндексацииЗаработка.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДанныеНабора.Период, ДЕНЬ)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПроверки = РезультатЗапроса.Выбрать();
	
	Если ВыборкаПроверки.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'В рамках одного дня возможно произвести индексацию только одним документом кадрового учета'");	
	КонецЕсли;

КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
